In [1]:
# Preprocesamiento de Datos con Python
# FES Aragon
# ICO
### BARREIRO CRUZ JESUS ARMANDO

In [5]:
import pandas as pd
import numpy as np

In [6]:
s = pd.Series({'a': 10, 'b': 20, 'c': 30}) #diccionario
print(type(s))

<class 'pandas.core.series.Series'>

In [7]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [8]:
s1 = pd.Series([10,20,30,40]) #listas
s1

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
s1.index #slicing

RangeIndex(start=0, stop=4, step=1)

In [10]:
s1.max()

40

In [11]:
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [12]:
#Generamos una serie de numeros aleatorios
s2 = pd.Series(np.random.randn(5)) 
s2

0    0.169149
1    0.195946
2    0.694364
3    2.828853
4    1.185731
dtype: float64

In [13]:
s3 = pd.Series([[10, 20], 
                [30, 40.5,'serie'],
                [50, 55],
                {'name':'Tess','org':'packt'}])
s3

0                            [10, 20]
1                   [30, 40.5, serie]
2                            [50, 55]
3    {'name': 'Tess', 'org': 'packt'}
dtype: object

In [14]:
s3.describe()

count            4
unique           4
top       [10, 20]
freq             1
dtype: object

In [15]:
s3[1][1]

40.5

In [16]:
s3.shape

(4,)

In [17]:
#DataFrame
df = pd.DataFrame([30,50,20]) 
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(3, 1)

In [18]:
df

    0
0  30
1  50
2  20

In [19]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
list(df.index)

[0, 1, 2]

In [22]:
print("Las columnas del DF son ", list(df.columns))
print("Los indices de renglones del DF son ", list(df.index))

Las columnas del DF son  [0]
Los indices de renglones del DF son  [0, 1, 2]

In [23]:
df.columns = ["C1"]
df.index = ["R1","R2","R3"]
df

    C1
R1  30
R2  50
R3  20

In [24]:
df["C1"]

R1    30
R2    50
R3    20
Name: C1, dtype: int64

In [25]:
l =  [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data = l)
print(df1.shape)
df1

(4, 3)

   0  1  2
0  0  1  2
1  1  2  3
2  4  5  6
3  7  8  9

In [26]:
l1 =  [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9,10)]
df2 = pd.DataFrame(data = l1)
df2

   0  1  2     3
0  0  1  2   NaN
1  1  2  3   NaN
2  4  5  6   NaN
3  7  8  9  10.0

In [27]:
l =  [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data = l, 
                   columns=("C1","C2","C3"),
                   index = ["R1", "R2", "R3","R4"]) #dupla #lista
df1

    C1  C2  C3
R1   0   1   2
R2   1   2   3
R3   4   5   6
R4   7   8   9

In [28]:
df1.describe()

             C1        C2        C3
count  4.000000  4.000000  4.000000
mean   3.000000  4.000000  5.000000
std    3.162278  3.162278  3.162278
min    0.000000  1.000000  2.000000
25%    0.750000  1.750000  2.750000
50%    2.500000  3.500000  4.500000
75%    4.750000  5.750000  6.750000
max    7.000000  8.000000  9.000000

In [30]:
#df12.describe()

In [31]:
d = {'py101':[10, 5, 33 ,45, 25, 22], 
     'py111':[0, 15, 21 , 30, 31, 11], 
     'py121':[15, 5, 1, 10, 42, 21], 
     'py301':[20, 35, 3 ,15, 0, 0], }
meses = ('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio')

df4 = pd.DataFrame(data=d, index = meses)
df4

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [32]:
m = np.arange(9).reshape(3,3)
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [33]:
df5 = pd.DataFrame(m,index=["uno","dos","tres"], columns=["C1",2, "C3"])
df5

      C1  2  C3
uno    0  1   2
dos    3  4   5
tres   6  7   8

In [34]:
df5.columns

Index(['C1', 2, 'C3'], dtype='object')

In [35]:
d

{'py101': [10, 5, 33, 45, 25, 22],
 'py111': [0, 15, 21, 30, 31, 11],
 'py121': [15, 5, 1, 10, 42, 21],
 'py301': [20, 35, 3, 15, 0, 0]}

In [36]:
df6 = pd.DataFrame(data=d, index=meses, columns=['py101', 'sillas', 'bancos', 'puertas'])
df6

         py101 sillas bancos puertas
enero       10    NaN    NaN     NaN
febrero      5    NaN    NaN     NaN
marzo       33    NaN    NaN     NaN
abril       45    NaN    NaN     NaN
mayo        25    NaN    NaN     NaN
junio       22    NaN    NaN     NaN

In [48]:
df7 = pd.DataFrame(d, index=meses)


#Cambiar nombres de columnas del DF
df7.columns = {'BD', 'TEBD', 'UML', 'JAVA'}
df7

         BD  UML  JAVA  TEBD
enero    10    0    15    20
febrero   5   15     5    35
marzo    33   21     1     3
abril    45   30    10    15
mayo     25   31    42     0
junio    22   11    21     0

In [49]:
#Cambiar el nombre de algunas columnas
df7.rename(columns={'UML':'SI', 'JAVA':'POO'}, inplace=True)
df7

         BD  SI  POO  TEBD
enero    10   0   15    20
febrero   5  15    5    35
marzo    33  21    1     3
abril    45  30   10    15
mayo     25  31   42     0
junio    22  11   21     0

In [50]:
#Cambiar todos los indices del DF
df7.index = ['ene', 'feb', 'mar', 'abr', 'may', 'jun']
df7

     BD  SI  POO  TEBD
ene  10   0   15    20
feb   5  15    5    35
mar  33  21    1     3
abr  45  30   10    15
may  25  31   42     0
jun  22  11   21     0

In [61]:
df7.rename(index = {'feb':'febrero','may':'mayo'}, inplace=True)
df7

         BD  SI  POO  TEBD
ene      10   0   15    20
febrero   5  15    5    35
mar      33  21    1     3
abr      45  30   10    15
mayo     25  31   42     0
jun      22  11   21     0

In [63]:
df7.rename(index = {'febrero':'feb', 'mayo':'may'},
          columns={'SI':'PROG1'},
          inplace=True)
df7

     BD  PROG1  POO  TEBD
ene  10      0   15    20
feb   5     15    5    35
mar  33     21    1     3
abr  45     30   10    15
may  25     31   42     0
jun  22     11   21     0

In [64]:
df7.describe()

              BD      PROG1        POO       TEBD
count   6.000000   6.000000   6.000000   6.000000
mean   23.333333  18.000000  15.666667  12.166667
std    14.706008  11.865918  14.719601  13.934370
min     5.000000   0.000000   1.000000   0.000000
25%    13.000000  12.000000   6.250000   0.750000
50%    23.500000  18.000000  12.500000   9.000000
75%    31.000000  27.750000  19.500000  18.750000
max    45.000000  31.000000  42.000000  35.000000

In [65]:
df7['POO']

ene    15
feb     5
mar     1
abr    10
may    42
jun    21
Name: POO, dtype: int64

In [66]:
df7[['POO', 'BD']]

     POO  BD
ene   15  10
feb    5   5
mar    1  33
abr   10  45
may   42  25
jun   21  22

In [67]:
dfPOOBD = df7[['POO','BD']]
dfPOOBD

     POO  BD
ene   15  10
feb    5   5
mar    1  33
abr   10  45
may   42  25
jun   21  22

In [76]:
#df7['mar':'mayo']['POO']
#df7

In [75]:
#df7['marzo':'mayo'][['POO','BD']]

In [71]:
df7[1:4]

     BD  PROG1  POO  TEBD
feb   5     15    5    35
mar  33     21    1     3
abr  45     30   10    15

In [72]:
df7[::2]

     BD  PROG1  POO  TEBD
ene  10      0   15    20
mar  33     21    1     3
may  25     31   42     0

In [73]:
df7['BD'][::2]

ene    10
mar    33
may    25
Name: BD, dtype: int64

In [86]:
#"from datetime import datetime
#df = pd.DataFrame({'nombres':('Juan Prez', 'Mara Snchez', 'Jorge Vargas', 
                 #            'Rodrigo Martnez'), 
                                     
                #   'fechas':(datetime(1995,12,21), 
               #              datetime(1989,1,13), 
              #               datetime(1992,9,14), 
             #                datetime(1993,7,8)),
                   
            #        'saldo':(2500, 5345, 11323.2),
                   
                   #'al_corriente':(Cierto, Verdadero, Falso, Verdadero)
           #       })

In [87]:
df.dtypes

C1    int64
dtype: object

In [88]:
df.describe()

              C1
count   3.000000
mean   33.333333
std    15.275252
min    20.000000
25%    25.000000
50%    30.000000
75%    40.000000
max    50.000000

In [90]:
#df['saldo'].describe()

In [ ]:
df.astype(str).dtypes

In [ ]:
df['fechas'].astype(int)

In [ ]:
df['saldo']*1.16

In [ ]:
df['saldo_iva']= df['saldo']*1.16

In [ ]:
df['saldo_iva'] = sf['saldo_iva'].astype(str)
df.dtypes

In [ ]:
df['saldo_iva']*12